Revit 2027 API
FabricationNetworkChangeService.SetServiceId Method
 Set the fabrication service identifier to change the elements to.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetServiceId(
	int serviceId
)
Public Sub SetServiceId (
	serviceId As Integer
)
public:
void SetServiceId(
	int serviceId
)
member SetServiceId :
        serviceId : int -> unit
Parameters
serviceId Int32
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace